In [6]:
from dbfread import DBF
import pandas as pd
import dask.dataframe as dd
from pandas import DataFrame

""" 
    To do
    [ ] - Read the DBF file
    [ ] - Convertir DBF to pandas
    [ ] - Clean the data
"""

' \n    To do\n    [ ] - Read the DBF file\n    [ ] - Convertir DBF to pandas\n    [ ] - Clean the data\n'

In [12]:

#si no encuentra su traspaso , tiene que buscarlo en la anterios fecha

COSTOS22 = 'Bases 2022/31-12-2022/Spm2003/2022/costos22.DBF'
TRASPASOS = 'Bases 2022/31-12-2022/Spm2003/2022/traspasos.DBF'
TRASPASOS_2021= 'Bases 2021/31-12-2021/Spm2003/2021/traspasos.DBF'

In [13]:
# Read the DBF file
dbf = DBF(COSTOS22)

# Convertir DBF to pandas dask
# data = dd.from_pandas(pd.DataFrame(iter(dbf)), npartitions=3)

In [4]:
class Record(object):
    def __init__(self, items):
        for (name, value) in items:
            setattr(self, name, value)

In [78]:
# data = data.astype({"PASO1": 'int64'})

In [10]:
dbfTraspasos = DBF(TRASPASOS)
# Convertir DBF to pandas dask

In [ ]:
dataTraspasos = dd.from_pandas(pd.DataFrame(iter(dbfTraspasos)), npartitions=3)

In [9]:
dataTraspasos = dataTraspasos.astype({"NROTRASP": 'int64'})

In [10]:
dbfTraspasos2021 = DBF(TRASPASOS_2021)
# Convertir DBF to pandas dask
dataTraspasos2021 = dd.from_pandas(pd.DataFrame(iter(dbfTraspasos2021)), npartitions=3)

In [11]:
dataTraspasos2021 = dataTraspasos.astype({"NROTRASP": 'int64'})

In [12]:
dataTraspasos= dd.concat([dataTraspasos,dataTraspasos2021],axis=0)
dataTraspasos = dataTraspasos[['NROTRASP','FECHORA']]

In [137]:
dataTraspasos.head()

   NROTRASP                 FECHORA
0    549332 2022-01-03 10:30:49.000
1    549333 2022-01-03 10:42:30.999
2    549334 2022-01-03 10:42:53.999
3    549335 2022-01-03 10:43:04.000
4    549336 2022-01-03 10:43:19.000

In [13]:
dataTraspasos.query('NROTRASP==519919').compute()

Empty DataFrame
Columns: [NROTRASP, FECHORA]
Index: []

In [157]:
dataTraspasos2021.query('NROTRASP==546303').compute()

Empty DataFrame
Columns: [NROTRASP, ORDEN, DCCOSTO, ACCOSTO, CANT_PR, FECHORA, ESTADO, USUARIO, OBS_TRP]
Index: []

In [143]:
reduceData = data[['CODIGO','PASO1','CCOSTO1','FECHA1']]

In [148]:
NAME = "PASO1"
join = reduceData.merge(dataTraspasos, left_on='PASO1', right_on='NROTRASP', how='left')
join = join.rename(columns={'FECHORA': 'FECHORA1'})

In [149]:
join.compute()

,CODIGO,PASO1,CCOSTO1,FECHA1,NROTRASP,FECHORA1
0,040990300001,567382,650,2022-08-31,567382.0,2022-08-31 10:43:55.000
1,040990300001,567382,650,2022-08-31,567382.0,2022-08-31 10:43:55.000
2,040990300001,567382,650,2022-08-31,567382.0,2022-08-31 10:43:55.000
3,040990300001,567382,650,2022-08-31,567382.0,2022-08-31 10:43:55.000
4,040990300001,567382,650,2022-08-31,567382.0,2022-08-31 10:43:55.000
...,...,...,...,...,...,...
7092,040940100001,566792,100,2022-08-24,566792.0,2022-08-24 08:52:37.999
7093,040940100001,566792,100,2022-08-24,566792.0,2022-08-24 08:52:37.999
7094,040940100001,566792,100,2022-08-24,566792.0,2022-08-24 08:52:37.999
7095,040940100001,566792,100,2022-08-24,566792.0,2022-08-24 08:52:37.999
7096,040940100001,566792,100,2022-08-24,566792.0,2022-08-24 08:52:37.999

In [150]:
not_nan_count = join['FECHORA1'].isna().sum()
not_nan_count.compute()

1947

In [154]:
result=join[join['FECHORA1'].isna()].head()
result

         CODIGO   PASO1 CCOSTO1      FECHA1  NROTRASP FECHORA1
0  039810500001  546303     100  2021-11-26       NaN      NaT
1  039810500002  546303     100  2021-11-26       NaN      NaT
2  039810500003  546303     100  2021-11-26       NaN      NaT
3  039810500004  546303     100  2021-11-26       NaN      NaT
4  039810500005  546303     100  2021-11-26       NaN      NaT